# vim: set ft=ruby :
tap "aquaproj/aqua"
tap "fujiwara/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "k1low/tap"
tap "kayac/tap"
tap "lintnet/lintnet"
tap "oven-sh/bun"
tap "reviewdog/tap"
tap "suzuki-shunsuke/cmdx"
tap "suzuki-shunsuke/ghalint"
brew "actionlint"
brew "aptly"
brew "aws-nuke"
brew "aws-vault"
brew "bash"
brew "bat"
brew "cloudflare-wrangler2"
brew "cntb"
brew "cosign"
brew "curl"
brew "dagger"
brew "devcontainer"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "editorconfig-checker"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "gitleaks"
brew "glab"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "gosec"
brew "govulncheck"
brew "hadolint"
brew "hcl2json"
brew "helm"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "lima"
brew "lnav"
brew "lua-language-server"
brew "marp-cli"
brew "melange"
brew "mise"
brew "neovim"
brew "nerdctl"
brew "nfpm"
brew "opentofu"
brew "oras"
brew "pnpm"
brew "pre-commit"
brew "procs"
brew "rclone"
brew "rekor-cli"
brew "renovate"
brew "ripgrep"
brew "rustup-init"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "staticcheck"
brew "step"
brew "tfenv"
brew "tmux"
brew "tpm"
brew "trivy"
brew "vivid"
brew "yamlfmt"
brew "yamllint"
brew "yarn"
brew "yarn-completion"
brew "zoxide"
brew "zsh"
brew "aquaproj/aqua/aqua"
brew "fujiwara/tap/lambroll"
brew "go-task/tap/go-task"
brew "hashicorp/tap/packer"
brew "k1low/tap/octocov"
brew "k1low/tap/runn"
brew "kayac/tap/ecspresso"
brew "lintnet/lintnet/lintnet"
brew "oven-sh/bun/bun"
brew "reviewdog/tap/reviewdog"
brew "suzuki-shunsuke/cmdx/cmdx"
brew "suzuki-shunsuke/ghalint/ghalint"
